fraserb99/ee579-msp430/Group Project/main.c
    return 0;

}

//function for checking which timer is free,
int activate_free_timer(int registers, int counts[]){
    //check which registers are free, if less than the register amount, return error
    int free[6] = {};
    unsigned int index = 0;
    unsigned int i;
    for(i=0; i < 6; i++){
       if((timers_used[i] == 0) || (timers_used[i] == counts[index])){
           free[index] = i;
           index++;
       }

    }
    //reset activated timers
    activated_timers[0] = -1;
    activated_timers[1] = -1;


    if(index < registers){
        //return error
        return 0;
    } else { //right number was found, activate them
        for (i=0; i < registers; i++){
            switch (free[i]){
            case 0:
                //activate register A0_0, check if A0 is already active
                if(!timer0_activated){
                    activate_timer(0, counts[i], 0);
                } else if(timers_used[0] == 0) {
                    TA0CCTL0 |= CCIE;
                    TA0CCR0 = counts[i];
                } //if timer was used continue

                //set it as active
                timers_used[0] = counts[i];
                //set it as activated
                activated_timers[i] = 0;
                break;
            case 1:
                //activate A0_1
                //if A0_0 wasn't available then A0 was already activated so don't need to check again
                if(timers_used[1] == 0){
                    TA0CCTL1 |= CCIE;
                    TA0CCR1 = counts[i];
                }
                //set it as active
                timers_used[1] = counts[i];
                //set it as activated
                activated_timers[i] = 1;
                break;
            case 2:
                //activate A0_2
                if(timers_used[2] == 0){
                    TA0CCTL2 |= CCIE;
                    TA0CCR2 = counts[i];
                }
                //set it as active
                timers_used[2] = counts[i];
                //set it as activated
                activated_timers[i] = 2;
                break;
            case 3:
                //activate A1_0check if A1 is already active
                if(!timer1_activated){
                    activate_timer(1, counts[i], 0);
                } else if(timers_used[3] == 0) {
                    TA1CCTL0 |= CCIE;
                    TA1CCR0 = counts[i];
                }
                //set it as active
                timers_used[3] = counts[i];
                //set it as activated
                activated_timers[i] = 3;
                break;
            case 4:
                //activate A1_1
                if(timers_used[4] == 0){
                   TA1CCTL1 |= CCIE;
                   TA1CCR1 = counts[i];
                }

                //set it as active
                timers_used[4] = counts[i];
                //set it as activated
                activated_timers[i] = 4;
                break;
            case 5:
                //activate A1_2
                if(timers_used[4] == 0){
                    TA1CCTL2 |= CCIE;
                    TA1CCR2 = counts[i];
                }
                //set it as active
                timers_used[5] = counts[i];
                //set it as activated
                activated_timers[i] = 5;
                break;
            default:
                return 0;
            }
        }
        return 1;
    }

}

//function to turn off the timers activated - or set the count value to 0, check if each value is now zero so the full timer should be turned off
void deactivate_timer(int activated[], int len){
    unsigned int i;
    for(i=0; i < len; i++){
        int deactivate = activated[i];

        switch (deactivate){ //deactivate specific timer count register
        case 0:
            TA0CCR0 = 0;
            timers_used[0] = 0;
            break;
        case 1:
            TA0CCR1 = 0;
            timers_used[1] = 0;
            break;
        case 2:
            TA0CCR2 = 0;
            timers_used[2] = 0;
            break;
        case 3:
            TA1CCR0 = 0;
            timers_used[3] = 0;
            break;
        case 4:
            TA1CCR1 = 0;
            timers_used[4] = 0;
            break;
        case 5:
            TA1CCR2 = 0;
            timers_used[5] = 0;
            break;
        }
    }

    //check if all timers for A0 are 0
    int all_0 = 0;
    for(i=0; i<3; i++){
        if(timers_used[i] == 0){
            all_0++;
        }
    }

    if(all_0 == 3){
        TA0CTL = MC_0;      //turn off A0
        timer0_activated = 0;
    }

    //check if all registers for A1 is 0
    int all_1 = 0;
        for(i=3; i<6; i++){
            if(timers_used[i] == 0){
                all_1++;
            }
        }

        if(all_1 == 3){
            TA1CTL = MC_0;      //turn off A0
            timer1_activated = 0;
        }
}

//Grab the correct code for the timers
int get_timer_code(int timers[]){
    int first = timers[0];
    int second = timers[1];

    switch (first){ //check which timer is first
            case 0:
                //get second value
                switch(second){
                case 1:
                    return 10;
                case 2:
                    return 11;
                case 3:
                    return 12;
                case 4:
                    return 13;
                case 5:
                    return 14;
                }
                break;
            case 1:
                //get second value
                switch(second){
                case 2:
                    return 15;
                case 3:
                    return 16;
                case 4:
                    return 17;
                case 5:
                    return 18;
                }
                break;
            case 2:
                //get second value
                switch(second){
                case 3:
                    return 19;
                case 4:
                    return 20;
                case 5:
                    return 21;
                }
                break;
            case 3:
                //get second value
                if(second == 4){
                    return 22;
                } else if (second == 5){
                    return 23;
                }
                break;
            case 4:
                if(second == 5){
                    return 24;
                }
                break;
            }
    return 0; //error occurred.
}



